tap "jandedobbeleer/oh-my-posh"   # Theme engine for prompt styling
tap "sinelaw/fresh"               # Fresh text editor tap

# Core CLI Tools
brew "htop"                       # Interactive process monitor
brew "jq"                         # JSON processor
brew "sinelaw/fresh/fresh-editor" # Fresh terminal text editor
brew "ripgrep"                    # Fast search utility
brew "tmux"                       # Terminal multiplexer
brew "tree"                       # Directory tree viewer

# Programming Languages
brew "go"                         # Go programming language

# Networking Tools
brew "iperf3"                     # Network throughput testing
brew "mtr"                        # Network diagnostic tool
brew "nmap"                       # Network scanning
brew "speedtest-cli"              # Internet bandwidth testing

# Misc
brew "just"                       # Task runner
brew "jandedobbeleer/oh-my-posh/oh-my-posh"  # Prompt theming engine
brew "pre-commit"                 # Git hook manager

# macOS Only (ignored on Linux)
cask "1password-cli"              # 1Password command-line tool
cask "meetingbar"                 # Menu app bar for calendar reminders
cask "monitorcontrol"             # External display brightness